In [1]:
import pandas as pd

In [2]:
cols = {'name' : ['Ankit', 'Vinay', 'Nigam'],
       'age': [10,20,30]}
df = pd.DataFrame(cols)

In [3]:
df

   age   name
0   10  Ankit
1   20  Vinay
2   30  Nigam

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
age     3 non-null int64
name    3 non-null object
dtypes: int64(1), object(1)
memory usage: 128.0+ bytes

In [5]:
df.columns

Index(['age', 'name'], dtype='object')

In [6]:
df.age

0    10
1    20
2    30
Name: age, dtype: int64

In [7]:
df.describe()

        age
count   3.0
mean   20.0
std    10.0
min    10.0
25%    15.0
50%    20.0
75%    25.0
max    30.0

# Similarities to python Dictionaries

In [8]:
df

   age   name
0   10  Ankit
1   20  Vinay
2   30  Nigam

In [9]:
df['last'] = pd.Series(['Anu', 'pannu', 'tannu'], index=[4,0,2])

In [10]:
df

   age   name   last
0   10  Ankit  pannu
1   20  Vinay    NaN
2   30  Nigam  tannu

In [11]:
df['instrument'] = ['Base', 'Guitar', 'Drum']

In [12]:
df

   age   name   last instrument
0   10  Ankit  pannu       Base
1   20  Vinay    NaN     Guitar
2   30  Nigam  tannu       Drum

In [13]:
#Broadcasting
df['birthplace'] = 'Kanpur'

In [14]:
df

   age   name   last instrument birthplace
0   10  Ankit  pannu       Base     Kanpur
1   20  Vinay    NaN     Guitar     Kanpur
2   30  Nigam  tannu       Drum     Kanpur

In [15]:
df.age

0    10
1    20
2    30
Name: age, dtype: int64

In [16]:
df['age']

0    10
1    20
2    30
Name: age, dtype: int64

In [17]:
df[['name', 'last']]  #unlike pythin dictionary

    name   last
0  Ankit  pannu
1  Vinay    NaN
2  Nigam  tannu

In [18]:
del df['last']

In [19]:
df

   age   name instrument birthplace
0   10  Ankit       Base     Kanpur
1   20  Vinay     Guitar     Kanpur
2   30  Nigam       Drum     Kanpur

In [20]:
#same as python dictionary
df.pop('birthplace')

0    Kanpur
1    Kanpur
2    Kanpur
Name: birthplace, dtype: object

In [21]:
df

   age   name instrument
0   10  Ankit       Base
1   20  Vinay     Guitar
2   30  Nigam       Drum

# Creation from Lists and Dicts

In [24]:
cols = {'name' : ['Ankit', 'Vinay', 'Nigam'],
       'age': [10,20,30]}
df = pd.DataFrame(cols, columns=['name','age'])

In [25]:
df

    name  age
0  Ankit   10
1  Vinay   20
2  Nigam   30

In [26]:
rows = [{'name' : 'Ankit', 'age' : 10},
       {'name' : 'Vinay', 'age' : 20},
       {'name' : 'Nigam', 'age' : 30}]
df = pd.DataFrame(rows)

In [27]:
df

   age   name
0   10  Ankit
1   20  Vinay
2   30  Nigam

In [28]:
import json
col_json = json.dumps(cols)
col_json

'{"name": ["Ankit", "Vinay", "Nigam"], "age": [10, 20, 30]}'

In [29]:
df = pd.read_json(col_json)

In [30]:
df

   age   name
0   10  Ankit
1   20  Vinay
2   30  Nigam

In [31]:
row_json = json.dumps(rows)
row_json

'[{"name": "Ankit", "age": 10}, {"name": "Vinay", "age": 20}, {"name": "Nigam", "age": 30}]'

In [32]:
df = pd.read_json(row_json)

In [33]:
df

   age   name
0   10  Ankit
1   20  Vinay
2   30  Nigam

# Reading from CSV Files

In [34]:
filename = 'temp.csv'
df = pd.read_csv(filename)

In [35]:
df

  Index  Temps
0     M     30
1     T     45
2     W     60
3    Th     90
4     M     60